//
//  GameModel.swift
//  CrocodileGame
//
//  Created by Артем Орлов on 16.04.2023.
//

import Foundation
import UIKit

let animalsArray = [
    "Собака", "Креветка", "Пеликан", "Осьминог", "Енот-полоскун",
    "Скунс", "Пеликан", "Лиса", "Лев", "Ленивец",
    "Краб", "Улитка", "Белка", "Павлин", "Змея",
    "Скорпион", "Муха", "Пчела", "Морской конек", "Осёл"
]

let foodArray = [
    "Оливье", "Борщ", "Булочка", "Хлеб", "Молоко",
    "Сметана", "Кефир", "Мороженое", "Мясо", "Шашлык",
    "Торт", "Зефир", "Помидор", "Огурец", "Лук",
    "Банан", "Арбуз", "Кабачок", "Баклажан", "Икра"
]

let peopleArray = [
    "Николай Фоменко", "Клаудиа Шиффер", "Мэрилин Мэнсон", "Дмитрий Нагиев", "Эдита Пьеха",
    "Шер", "Александр Суворов", "Александр Македонский", "Василий Чапаев", "Александр Пушкин",
    "Николай Цискаридзе", "Альберт Эйнштейн", "Николай Гоголь", "Филипп Киркоров", "Сергей Зверев",
    "Николай Басков", "Анастасия Волочкова", "Наполеон Бонапарт", "Леди Гага", "Мадонна"
]

let hobbyArray = [
    "Автомобили", "Астрономия", "Аэробика", "Бадминтон", "Бег",
    "Бильярд", "Блоггерство", "Боулинг", "Велосипед", "Видеомонтаж",
    "Вязание", "Гербарий", "Головоломки", "Гольф", "Горные лыжи",
    "Дайвинг", "Дартс", "Декупаж", "Дизайн интерьера", "Жонглирование"
]

let howToExplainArray = [
    "Объясни с помощью слов",
    "Объясни с помощью жестов",
    "Объясни с помощью рисунка",
    "Объясняй со злостью",
    "Объясняй с помощью мимики",
    "Объясняй вульгарно",
    "Объясняй сексуально"
]

let avatars = [UIImage(named: "Ковбои"), UIImage(named: "Красотки"), UIImage(named: "food")
]

struct Team {
    var name: String
    var points: Int
    var avatarName: UIImage?
}

var teams = [
    Team(name: "Ковбои", points: 0, avatarName: avatars[0]),
    Team(name: "Красотки", points: 0, avatarName: avatars[1])
]

class DataManager {
    static let shared = DataManager()
    var currentTeam = 1
    var numberOfTeams = teams.count
    var currentTeamIndex = 0
    var totalRounds = 0
}
